Revit 2026 API

# WallPaintWallpaintApplication Property

---

The property labeled "Application" from the "WallPaint" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string WallpaintApplication { get; }
```
```vb
Public Shared ReadOnly Property WallpaintApplication As String
	Get
```
```cpp
public:
static property String^ WallpaintApplication {
	String^ get ();
}
```
```fsharp
static member WallpaintApplication : string with get
```

#### Property Value

String

This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "WallpaintApplicationType".

#### Reference

WallPaint Class

Autodesk.Revit.DB.Visual Namespace